#ifndef TRANSITIONS_H_INCLUDED
#define TRANSITIONS_H_INCLUDED

#include <stdio.h>

__attribute((unused)) static const char TRANSITIONS[22][4096] =
{
"Ежу понятно:",
"Мф.21:12-14,17-20:",
"По определению:",
"Ну ты просто формулы распиши:",
"Старый кок:",
"А.В Перышкин, Е.М. Гутник, стр. 44001:",
"Ну как есть:",
"Ну каааак есть:",
"В 20-30 городах есть очень хорошие школы, хорошие учителя, но этого очень мало. Допустим, в параллели 10 тысяч школьников, да меньше, 5 тысяч школьников, а попадают в суперклассы, очень много остаются за бортом, потому что, например, в 172 школе – самой лучшей школе Москвы – конкурс 15 человек на место. И в конечном счете, когда проходят все собеседования за бортом остается 50 школьников, которые могли бы учиться в этом классе, но они туда не попадают, потому что имеющийся преподавательский состав в количестве 10 человек на 25 школьников – это уже маловато.",
"От противного:\\newline\nAborted (core dumped):",
"Вы можете быть скептиками, но я предлагаю согласиться с тем, что это очевидно:",
"Надеюсь всë понятно? Ну тут понимать нечего, даже я всë понимаю:",
"Я тоже когда-то был аутистом:",
"Кто не рискует, тот не пьëт шампанского. Ну, шампанское мы не пьëм, но рисковать придëтся:",
"Доказательство: чуем Коши:",
"... потому что так работают квантовые рояли:",
"Предположим, что я не помню, как выглядит критерий. Кстати, предположение верно:",
"Встречаются чукча с русским в тундре чукча:\\newline\n— Угадаешь сколько у меня оленей, обоих отдам русский:\\newline\n— Два.\\newline\nЧукча:\\newline\n— Ух, шаман однако!!!",
"- Поручик Ржевский! Вы подлец! Я требую удовлетворения!!!\n- Ну, пойдем, противный!",
"\"Почему бы нет?\" - сказал поручик Ржевский, заходя в конюшню:",
"Поручик Ржевский пошел с Наташей в оперу. Сидит, конечно ничего не понимает, через минут 20 не выдерживает :\\newline\n- Наташенька, зачем этот тип во фраке машет палкой на вон ту даму на сцене?\n- Поручик... он дирижирует!\n- А тогда почему эта дама так орет?",
"Самка бегемота достаточно грациозна и нежна в период спаривания. Но не стоит этого проверять! Поверьте мне на слово!",
};

__attribute((unused)) static const char* TEX_HEAD = "\\documentclass{article}\n\\usepackage[utf8]{inputenc}\n\\usepackage{amssymb}\n\\usepackage[russian]{babel}\n\\usepackage{amsmath}\n\\begin{document}\n";
__attribute((unused)) static const char* TEX_START_LINE = "Я всегда тяготел к экзотическим животным — змеям, черепахам. А жаб любил с самого детства. Ведь у них такой «улыбчивый» разрез рта, замечательные глаза с серебристой или золотистой крапинкой — куда там человеческим! Очень миролюбивы и неторопливы — незаменимые качества для хорошего соседа.\\newline\n";

#endif