#ifndef TRANSITIONS_H_INCLUDED
#define TRANSITIONS_H_INCLUDED

#include <stdio.h>

__attribute((unused)) static const char* TEX_FILE_FOLDER = "Tex/";
__attribute((unused)) static const char* DEFAULT_TEX_FILE_NAME = "Tex/Deriv.tex";

__attribute((unused)) static const char TRANSITIONS[22][FILENAME_MAX] =
{
"Ежу понятно:\n\\newline",
"Мф.21:12-14,17-20:\n\\newline",
"По определению:\n\\newline",
"Ну ты просто формулы распиши:\n\\newline",
"Старый кок:\n\\newline",
"А.В Перышкин, Е.М. Гутник, стр. 44001:\n\\newline",
"Ну как есть:\n\\newline",
"Ну каааак есть:\n\\newline",
"В 20-30 городах есть очень хорошие школы, хорошие учителя, но этого очень мало. Допустим, в параллели 10 тысяч школьников, да меньше, 5 тысяч школьников, а попадают в суперклассы, очень много остаются за бортом, потому что, например, в 172 школе – самой лучшей школе Москвы – конкурс 15 человек на место. И в конечном счете, когда проходят все собеседования за бортом остается 50 школьников, которые могли бы учиться в этом классе, но они туда не попадают, потому что имеющийся преподавательский состав в количестве 10 человек на 25 школьников – это уже маловато.\n\\newline",
"От противного:\\newline\nAborted (core dumped):\n\\newline",
"Вы можете быть скептиками, но я предлагаю согласиться с тем, что это очевидно:\n\\newline",
"Надеюсь всë понятно? Ну тут понимать нечего, даже я всë понимаю:\n\\newline",
"Я тоже когда-то был аутистом:\n\\newline",
"Кто не рискует, тот не пьëт шампанского. Ну, шампанское мы не пьëм, но рисковать придëтся:\n\\newline",
"Доказательство: чуем Коши:\n\\newline",
"... потому что так работают квантовые рояли:\n\\newline",
"Предположим, что я не помню, как выглядит критерий. Кстати, предположение верно:\n\\newline",
"Встречаются чукча с русским в тундре чукча:\\newline\n— Угадаешь сколько у меня оленей, обоих отдам русский:\\newline\n— Два.\\newline\nЧукча:\\newline\n— Ух, шаман однако!!!\n\\newline",
"- Поручик Ржевский! Вы подлец! Я требую удовлетворения!!!\n- Ну, пойдем, противный!\n\\newline",
"\"Почему бы нет?\" - сказал поручик Ржевский, заходя в конюшню:\n\\newline",
"Поручик Ржевский пошел с Наташей в оперу. Сидит, конечно ничего не понимает, через минут 20 не выдерживает :\\newline\n- Наташенька, зачем этот тип во фраке машет палкой на вон ту даму на сцене?\n- Поручик... он дирижирует!\n- А тогда почему эта дама так орет?\n\\newline",
"Самка бегемота достаточно грациозна и нежна в период спаривания. Но не стоит этого проверять! Поверьте мне на слово!\n\\newline",
};
#endif